--[[ Tutorial used by ../SimpleTutorial.lua
author: LiXizhi
date: 2006.9.8
use the lib:
------------------------------------------------------------
NPL.load("(gl)script/AI/templates/TutorialText/BasicTutorial_part2.lua");
local s = _AI_tutorials["intro"]; -- s is an array of text
------------------------------------------------------------
]]

if(not _AI_tutorials) then _AI_tutorials={}; end

local s;
-- intro
s={
	"你好小朋友",
	"去和其他的人说话,他们会告诉你一些小技巧",
	"再见",
};
_AI_tutorials["part2"] = s;

-- 走路
s={
	"你好小朋友",
	"你知道怎么控制走路吗？",
	"按“W”键是前进",
	"按“S”键是后退",
	"按“A”键是向左",
	"按“D”键是向右",
	"按“空格键”可以跳跃哦~",
	"按住鼠标右键，同时拖动鼠标可以调整视角",
	"OK，我已经告诉你怎么控制走路了。还想听一遍？",
};
_AI_tutorials["zoulu"] = s;

-- 驾驶
s={
	"你好小朋友",
	"你可以驾驶我旁边的直升机",
	"走近后，按右边的shift键",
	"按字母O键驾驶飞机",
	"再按字母O键切换到人物",
	"再按空格键离开飞机",
	"祝你好运，再见！",
	"我已经告诉过你如何驾驶飞机了。还想听一遍？",
};
_AI_tutorials["plan"] = s;

-- 附身
s={
	"你好小朋友",
	"知道怎么附身吗？",
	"鼠标双击你想附身的人物",
	"在控制面板左下角会出现附身的按钮",
	"点击附身按钮，你就可以控制这个人物了",
	"还有一种更快速的附身方法",
	"按下键盘”O“键，变可以切控制另一个人物了",
	"重复按“O”键可在各个人物中来回切换控制",
	"我已经告诉过你如何附身了。还想听一遍？",
};
_AI_tutorials["fushen"] = s;
_AI_tutorials["part2"] = s;

--建设
s={
	"你好小朋友",
	"你可以在这个游戏里建造一个你想象中的世界！是不是很棒啊！~",
	"在控制面板的右下角有一圈红色按钮",
	"点击红色按钮可以打开物体选择面板",
	"选择好你要建造的物体，点击对应的图标后，",
	"在你控制的人物脚下就生成了这个物体",
	"我已经告诉过你如何建造物体了。还想听一遍？",
};
_AI_tutorials["jianshe"] = s;
_AI_tutorials["part2"] = s;
-- 编辑
s={
	"你好小朋友",
	"知道怎么编辑你建造好的物体吗？",
	"第一步，先点击你要编辑的物体",
	"在左下角的预览框里看见你编辑的物体，表示此时已经选种",
	"第二步，此时在控制面板里有旋转、平移、重置的编辑按钮",
	"点击对应的按纽就可以进行编辑操作",
	"第三步，保存。记住，在空话子面板的右下交有一个保存按钮。你编辑的任何物体",
	"你编辑的任何物体，一定要在最后保存一次",
		"我已经告诉过你如何编辑物体了。还想听一遍？",
};
_AI_tutorials["bianji"] = s;