--[[ Tutorial used by ../SimpleTutorial.lua
author: LiXizhi
date: 2006.9.8
use the lib:
------------------------------------------------------------
NPL.load("(gl)script/AI/templates/TutorialText/BasicTutorial_part2.lua");
local s = _AI_tutorials["intro"]; -- s is an array of text
------------------------------------------------------------
]]

if(not _AI_tutorials) then _AI_tutorials={}; end

local s;
-- intro
s={
	"你好小朋友",
	"去和其他的人说话,他们会告诉你一些小技巧",
	"再见",
};
_AI_tutorials["part3"] = s;

--驾驶
s={
	"你好小朋友",
	"你可以驾驶我旁边的直升机",
	"走近后，按右边的shift键",
	"按字母O键驾驶飞机",
	"再按字母O键切换到人物",
	"再按空格键离开飞机",
	"祝你好运，再见！",
	"我已经告诉过你如何驾驶飞机了。还想听一遍？",
};
_AI_tutorials["feiji"] = s;

--设置
s={
	"你好小朋友，我来教你设置游戏，使得它在你的电脑上运行的更好！",
	"首先，点击打开屏幕右下角齿轮型的设置按钮。你会看到一个复杂的设置界面。",
	"下面我们来详细的解释这个界面。",
	"“当前时间”，会影响有戏中太阳的东升西落，通过拖动时间调杆，你可以感受一下^^",
	"很好，然后就是“特效选择”的设置。",
	"一般来说，在不会使游戏运行缓慢的前提下，将性能调杆拉向右面的“最佳效果”",
	"然后系统会自动进行相应的性能设置。",
	"小提示：在截图的时候尽可能的调高效果可以使你过得更好质量的照片。",
	"接下来是天空的选择。",
	"你可以通过点击3种默认的设置来进行快速设置。",
	"现在你就可以试一试。",
	"怎么样？设置简单吧^^,刚才还有没听清楚的么？",
};
_AI_tutorials["setting"] = s;

--删除物品
s={
	"很多时候，我们会发现游戏世界中有些我们不喜欢的物品。",
	"下面我们来删除它们。",
	"首先，靠近你要删除的物品，用鼠标左键单击它。",
	"你会在左下角的物品浏览窗中看到它。",
	"然后单击物品浏览窗周围的“删除”按钮。",
	"看！它消失了！",
	"现在你就可以试一试。",
	"怎么样？删除简单吧^^,刚才还有没听清楚的么？",
};
_AI_tutorials["delete"] = s;

--存盘
s={
	"我们已经建立了一个漂亮的游戏世界。",
	"需要保存，以便下次继续修改或浏览。",
	"想要存盘的时候，请点击屏幕右下角的“存盘”图标。",
	"就是那个磁盘形状的按钮。",
	"然后他会询问我们是否“保存当前世界？”",
	"点击“是”，这样就完成存盘了。",
	"现在你就可以试一试。",
	"怎么样？存盘简单吧^^,刚才还有没听清楚的么？",
};
_AI_tutorials["save"] = s;

--AI使用
s={
	"我们已经在有戏中添加了一些人物，现在我们要他们聪明起来。",
	"为其他人物添加“人工智能”，是需要一些小技巧的。",
	"下面，我们来讲解最基本的操作。",
	"首先，靠近并点击我们创造好的人物。然后点击左下角的“属性”按钮。",
	"然后在屏幕底部中央你会看到很多“行为命令”。",
	"首先，将目标设置为“NPC”",
	"然后点击“行为”的第二个，“随机走动”",
	"他就开始自己散步了！！",
	"现在你就可以试一试。",
	"然后可以逐一尝试众多的行为列表。",
	"怎么样？人工智能简单吧^^,刚才还有没听清楚的么？",
};
_AI_tutorials["ai"] = s;
